lisp/init-org.org
 #+TITLE: My Org Initialization
#+AUTHOR: Joshua Branson
#+PROPERTY: header-args :
# this says that org mode will export up to the 4th level heading
# +OPTIONS: H:4

Org-mode is Emacs' organizational mode, and it is amazing!  [[http://doc.norang.ca/org-mode.html][Here]] is an online example configuration that is a little more thorough than this configuration.

* COMMENT Org's 8.3 stable version

Org-mode has just updated to a stable version.  release notes are here: http://orgmode.org/Changes.html

Property drawers now have to be under a headline and its scheduling line.

Org-babel mode now supports sed!
* My org use-package declaration
:PROPERTIES:
:ID:       e5893542-ca4c-44b6-be5f-d6bcbe365f36
:END:
Make C-c SPC inside an org table mean clear that table section.  If you are outside of an org table, make it mean
just one space.

  #+BEGIN_SRC emacs-lisp
    (defun my-just-one-space ()
      (interactive)
      (if (org-at-table-p)
          (org-table-blank-field)
        (just-one-space)))

    (use-package org :bind (:map org-mode-map ("C-c SPC" . my-just-one-space))
      :ensure org-plus-contrib)
  #+END_SRC

  #+RESULTS:

* Setting up Org-plugins
** org-crypt
:PROPERTIES:
:ID:       c285b242-e60d-46c0-bd87-c10887f9448b
:END:
  Encrypting text under a heading in org [[info:org#org-crypt][info:org#org-crypt]] Any text below a headline that has a `:crypt:' tag will be automatically be encrypted when the file is saved.  If you want to use a different tag just customize the `org-crypt-tag-matcher' setting.
  So the following org heading would be encrypted

  #+BEGIN_SRC org
    ,* encrypted                                                                     :crypt:
      -----BEGIN PGP MESSAGE-----
      Version: GnuPG v2

      hQEMA8CBlfhZifrPAQgArs3jyd5tVD5v1XCeort5/iftb+xBhNZ2wM4qPtwSValY
      hO/dENekYvYl3SyiX9lhBVZM8C+a5aMhrvorHlzqJc5AX/YL2HK3T9liODFZp7Wi
      Z3ZDTSQUXdNRP7bcvBR5OdetPG5knLDLCyAbfGwWbmpT10m/oufsFZtOnbv+109q
      2ffMmA2e2b+GycFH8H3IvRUz4kUW712ONk9wEI4fHH/09RWp7ouNlSvhs5ZWn1hm
      p57IjIulducRe+ZBkeA3TPfIGtEzczoKQUbTD9uVgWQ5ZW0SRQgFpXBv4oamudf0
      N6XqZ1XI6jJycKG49GhHe+zkwD31cmRNfOx1bFWePNJKAZEtVJ/5uU+mUY3i786I
      Lnldc/ZU9oLqULVoZ6q2cufXI+7A1ghOVqeKTgT6UPFny6eww7hg/EKI3bsmhbCs
      8Sa1s2Yws8ral/s=
      =/leP
      -----END PGP MESSAGE-----
  #+END_SRC

To use org-crypt it is suggested that you have the following in your `.emacs':

  #+BEGIN_SRC emacs-lisp
    (use-package org-crypt
      :config
      (org-crypt-use-before-save-magic)
      (setq org-tags-exclude-from-inheritance (quote ("crypt"))))
  #+END_SRC

  I personally don't use org-crypt too much anymore. [fn:2]  It automatically encrypts the text you are working on when you save the file.  I find it is easier just to encrypt the entire file via M-x epa-encrypt-file.

  #+RESULTS:
  | crypt |

  GPG key to use for encryption
  Either the Key ID or set to nil to use symmetric encryption.
  This is my key for my email address.
  #+BEGIN_SRC emacs-lisp
     (setq org-crypt-key "C8FA3D82C7B1326F")
  #+END_SRC

  #+RESULTS:
  : E99C48112E969A17
  Auto-saving does not cooperate with org-crypt.el: so you need to turn it off if you plan to use org-crypt.el quite often.
  Otherwise, you'll get an (annoying) message each time you start Org.
  To turn it off only locally, you can insert this:
  # -*- buffer-auto-save-file-name: nil; -*-
  #+BEGIN_SRC emacs-lisp
    (setq auto-save-default nil)
  #+END_SRC

  #+RESULTS:

** org mime
:PROPERTIES:
:ID:       b1838e30-a287-48cd-8267-3b36a25a8115
:END:

  http://orgmode.org/worg/org-contrib/org-mime.html
  I want to figure out how to install this, because I could then write html emails trivially with gnus
  #+BEGIN_SRC emacs-lisp
  (use-package org-mime :ensure t)
  #+END_SRC

  #+RESULTS:
  : org-mime

   imported code from http://orgmode.org/worg/org-contrib/org-mime.html

  for those who use color themes with Dark backgrounds it is useful to set a dark background for all exported code blocks and example regions. This can be accomplished with the following:  And you should totally do this!  it looks SOO COOOL!
  #+BEGIN_SRC emacs-lisp
    ;; I'm having problems with this
    ;;(add-hook 'org-mime-html-hook
    ;;(lambda ()
    ;;(org-mime-change-element-style
    ;;"pre" (format "color: %s; background-color: %s; padding: 0.5em;"
    ;;"#E6E1DC" "#232323"))))
  #+END_SRC

  #+RESULTS:
  | lambda | nil | (org-mime-change-element-style pre (format color: %s; background-color: %s; padding: 0.5em; #E6E1DC #232323)) |

  the following can be used to nicely offset block quotes in email bodies
#+BEGIN_SRC emacs-lisp
  ;; I'm having problems with this
  ;;(add-hook 'org-mime-html-hook
  ;;(lambda ()
  ;;(org-mime-change-element-style
  ;;"blockquote" "border-left: 2px solid gray; padding-left: 4px;")))
#+END_SRC

#+RESULTS:
| lambda | nil | (org-mime-change-element-style blockquote border-left: 2px solid gray; padding-left: 4px;)                    |
| lambda | nil | (org-mime-change-element-style pre (format color: %s; background-color: %s; padding: 0.5em; #E6E1DC #232323)) |

end imported code

** org babel
:PROPERTIES:
:ID:       5fc7e3ce-61fb-47de-8517-29082f4d4340
:END:
Org babel lets you run code snippets inside org-mode!  It's a great literate programming environment!


  To edit a source code block, with point on the src block, type "C-c '".  For example move point to the next "#" on the
  =#+BEGIN_SRC= block, then type "C-c '".
  #+BEGIN_SRC org
    ,#+BEGIN_SRC sh
    ls
    ,#+END_SRC
  #+END_SRC

  #+BEGIN_SRC emacs-lisp
    ;; ob-http is needed to run http calls inside org-mode
    (use-package ob-http :ensure t)
    (setq geiser-default-implementation 'guile)

    ;; TODO FIXME this defun needs to be deleted
    ;; the org-mode has removed org-babel-get-header
    ;; ob-sh needs to update to use the new version.
    (defun org-babel-get-header (params key &optional others)
      (delq nil
            (mapcar
             (lambda (p) (when (funcall (if others #'not #'identity) (eq (car p) key)) p))
             params)))

    (after-load 'org
      (org-babel-do-load-languages
       'org-babel-load-languages
       '(
         (awk . t)
         (calc . t)
         (C . t)
         (emacs-lisp . t)
         (haskell . t)
         ;;(http . t)
         (gnuplot . t)
         ;;(latex . t)
         (ledger . t)
         (js . t)
         (perl . t)
         (python . t)
         (gnuplot . t)
         ;;org-babel does not currently support php.  That is really sad.
         ;;(php . t)
         ;;(R . t)
         (scheme . t)
         (sh . t)
         (sql . t)
         ;;(sqlite . t)
         )))

    (setq org-latex-create-formula-image-program 'imagemagick)
    ;; DO NOT set up ditaa.  It breaks (helm-find-files) C-x C-f
    ;;(ditaa . t)
    ;;(setq org-ditaa-jar-path "/usr/share/java/ditaa/ditaa-0_9.jar")
    ;; display inline images in org-mode
    ;;(add-hook 'org-babel-after-execute-hook 'org-display-inline-images 'append)
  #+END_SRC

  #+RESULTS:
*** fixing babel
:PROPERTIES:
:ID:       d1892137-5437-4a45-8615-c7ec0836e2f4
:END:

New versions of org have removed org-babel get header.  Some plugins still use it.  So I'm defining it until they catch up.

#+BEGIN_SRC emacs-lisp
(defun org-babel-get-header (params key &optional others)
  (delq nil
        (mapcar
         (lambda (p) (when (funcall (if others #'not #'identity) (eq (car p) key)) p))
         params)))
#+END_SRC
** org invoice
:PROPERTIES:
:ID:       4dc5cf24-8878-498c-a332-41f87ee08fda
:END:

  #+BEGIN_SRC emacs-lisp
    (use-package org-invoice)
  #+END_SRC

  #+RESULTS:
  : org-invoice

  This lests you manage invoices with org-mode.  It is pretty cool!
  You can create invoices with the following format.  And just call org-invoice-report on the
  begin invoice.  Be careful NOT to put an inactive time stamp anywhere in the tree unless you want that
  parent to show up in the invoice.  ie: If you create a notes heading, don't have an inactive time stamp like
  <2015-09-02 Sat> because when you generate that invoice, Notes will show up in the invoice even though it
  has no time associated with it

  #+BEGIN_SRC org
    ,* Working for Some Company

    ,#+BEGIN: invoice

     | Task / Date                   | Time |  Price |
     |-------------------------------+------+--------|
     | Wednesday, September 02, 2015 | 9:57 | 149.25 |
     | HTML Design                   | 9:57 | 149.25 |
     |-------------------------------+------+--------|
     | Total:                        | 9:16 | 149.00 |
    ,#+END:
  #+END_SRC

** COMMENT org-notify lets you know when you have upcoming appointments
  I would like to get this set up so that it shows pop-ups using a lua script.  That way I can set it up to use awesome's
  pop up library. At the moment it only notifies you when you have approaching deadlines and only certain ones.  It's a little odd.
 #+BEGIN_SRC emacs-lisp
   (use-package org-notify
     :config
     (org-notify-add 'appt
                     '(:time "-1s" :period "20s" :duration 10
                             :actions (-message -ding))
                     '(:time "15m" :period "2m" :duration 100
                             :actions -notify)
                     '(:time "2h" :period "5m" :actions -message)
                     '(:time "3d" :actions -email)))
   (add-hook 'after-init-hook 'org-notify-start)


  #+END_SRC

  #+RESULTS:
  | default | ((:time 1h :actions -notify/window :period 2m :duration 60)) | appt | ((:time -1s :period 20s :duration 10 :actions (-message -ding)) (:time 15m :period 2m :duration 100 :actions -notify) (:time 2h :period 5m :actions -message) (:time 3d :actions -email)) |

** org-inlinetask
:PROPERTIES:
:ID:       ea415ac9-07b1-4eae-a8eb-3cd84d7f216c
:END:
   Org inline task lets you define an inline task without treating it like a headline
   #+BEGIN_SRC emacs-lisp
     (use-package org-inlinetask)
   #+END_SRC

   #+RESULTS:
   : org-inlinetask

   Suppose you have something like this where point is at point:

   #+BEGIN_SRC org
     - [X] Call the farmer about buying his cows

           POINT

           I let him know that his cows were all rather nice and left a voicemail.  If he does not get back to me,
           Then I'll have to call him again


     - [ ] call your momma
       Let her know she's a good Mom
   #+END_SRC

   Pressing C-c C-x t will insert an inline task like the one below

   #+BEGIN_SRC org
           - [X] Call the farmer about buying his cows
     ,*************** Call Mark S. Davis today again about making his site better.  If he does not respond move on.
                     SCHEDULED: <2015-11-30 Mon>
     ,*************** END
                 I let him know that his cows were all rather nice and left a voicemail.  If he does not get back to me,
                 Then I'll have to call him again


           - [ ] call your momma
             Let her know she's a good Mom
   #+END_SRC
** org-habit
:PROPERTIES:
:ID:       70cbc5a4-78cc-4fda-af2a-08f6a5ead72c
:END:
   Org habit is a nice way to let you know how well you are doing on your habits.  It shows you a nice
   little color graph in your agenda view.  It is kind of cool.
   #+BEGIN_SRC emacs-lisp
   (use-package org-habit)
   #+END_SRC

   #+RESULTS:
   : org-habit
** org-protocal
:PROPERTIES:
:ID:       692f9752-71fb-46ed-87ad-8a7bd664e42e
:END:
Org protocal allows you to capture things from firefox or other applications!  Cool!

#+BEGIN_SRC emacs-lisp
  (add-hook 'org-mode-hook '(lambda ()
                              (require 'org-protocol)))
#+END_SRC

#+RESULTS:
: org-protocol
** org-id
:PROPERTIES:
:ID:       ca509e16-9845-472b-be83-fc3a89a11a91
:END:
Org-id is a way to create unique IDs to org-mode files.  Each heading can have a unique ID.  Org can then create a link to that heading.  The link will still work, even if you move entry IDs between files.
#+BEGIN_SRC emacs-lisp
  (add-hook 'org-mode-hook '(lambda ()
                              (require 'org-id)
                              (setq org-id-link-to-org-use-id t)))
#+END_SRC
** COMMENT org-php
:PROPERTIES:
:ID:       ba5eaab7-14db-4c4a-9f23-81bc1d2895c7
:END:
This would be very cool if org-mode had this.
I need to have a php REPL available if I am going to get an ob-php.
#+BEGIN_SRC emacs-lisp
(use-package psysh :ensure t)
#+END_SRC

** org gnu-plot
:PROPERTIES:
:ID:       660f5c8d-f80d-43ea-a8ac-110be0a4d45f
:END:
#+BEGIN_SRC emacs-lisp
(use-package gnuplot :ensure t)
#+END_SRC

I can use org-mode to plot tables via gnu plot!

Just type C-"g below.  Or ~org-plot/gnuplot~
#+PLOT: title:"Citas" ind:1 deps:(3) type:2d with:histograms set:"yrange [0:]"
| Sede      | Max cites | H-index |
|-----------+-----------+---------|
| Chile     |    257.72 |   21.39 |
| Leeds     |    165.77 |   19.68 |
| Sao Paolo |     71.00 |   11.50 |
| Stockholm |    134.19 |   14.33 |
| Morelia   |    257.56 |   17.67 |

