lisp/init-org.el
(defun my-just-one-space ()
  (interactive)
  (if (org-at-table-p)
      (org-table-blank-field)
    (just-one-space)))

(use-package org
  :bind (:map org-mode-map
              ("C-c SPC" . my-just-one-space))
  :ensure org-plus-contrib)

;; define what files org opens
(add-to-list 'auto-mode-alist '("\\.\\(org\\|txt\\)$" . org-mode))
;;(setq org-default-notes-file (concat org-directory "/notes.org"))

(use-package org-crypt
  :config
  (org-crypt-use-before-save-magic)
  (setq org-tags-exclude-from-inheritance (quote ("crypt"))))

(setq org-crypt-key "C8FA3D82C7B1326F")

(setq auto-save-default nil)

(use-package org-mime)

;; I'm having problems with this
;;(add-hook 'org-mime-html-hook
;;(lambda ()
;;(org-mime-change-element-style
;;"pre" (format "color: %s; background-color: %s; padding: 0.5em;"
;;"#E6E1DC" "#232323"))))

;; I'm having problems with this
;;(add-hook 'org-mime-html-hook
;;(lambda ()
;;(org-mime-change-element-style
;;"blockquote" "border-left: 2px solid gray; padding-left: 4px;")))

;; ob-http is needed to run http calls inside org-mode
(use-package ob-http :ensure t)
(setq geiser-default-implementation 'guile)

(after-load 'org
    (org-babel-do-load-languages
     'org-babel-load-languages
     '(
       (awk . t)
       (calc .t)
       (C . t)
       (emacs-lisp . t)
       (haskell . t)
       (gnuplot . t)
       (latex . t)
       ;;(ledger . t)
       (js . t)
       (haskell . t)
       (http . t)
       (perl . t)
       (python . t)
       ;; (gnuplot . t)
       ;; org-babel does not currently support php.  That is really sad.
       ;;(php . t)
       (R . t)
       (scheme . t)
       (sh . t)
       (sql . t)
       ;;(sqlite . t)
       )))

       (setq org-latex-create-formula-image-program 'imagemagick)
  ;; DO NOT set up ditaa.  It breaks (helm-find-files) C-x C-f
  ;;(ditaa . t)
  ;;(setq org-ditaa-jar-path "/usr/share/java/ditaa/ditaa-0_9.jar")
  ;; display inline images in org-mode
  ;;(add-hook 'org-babel-after-execute-hook 'org-display-inline-images 'append)

(use-package org-invoice)

(use-package org-notify)
(org-notify-start)

(org-notify-add 'appt
                '(:time "-1s" :period "20s" :duration 10
                        :actions (-message -ding))
                '(:time "15m" :period "2m" :duration 100
                        :actions -notify)
                '(:time "2h" :period "5m" :actions -message)
                '(:time "3d" :actions -email))

(use-package org-inlinetask)

(use-package org-habit)

(require 'org-protocol)

(require 'org-id)
(setq org-id-link-to-org-use-id t)
