lisp/init-org.el

(defun yas/org-very-safe-expand ()
    (let ((yas/fallback-behavior 'return-nil)) (yas/expand)))

;; I want to get write-good-mode set up again, because it's awesome.
(use-package writegood-mode :ensure t :defer t)

(add-hook 'org-mode-hook '(lambda ()

                                ;; https://bitbucket.org/ukaszg/org-eldoc org eldoc looks cool
                                ;; but I can't get it to work
                                ;; (require 'org-eldoc)
                                ;;(org-eldoc-load)
                                ;; (make-variable-buffer-local 'yas/trigger-key)
                                ;;(setq yas/trigger-key [tab])
                                ;;(add-to-list 'org-tab-first-hook 'yas/org-very-safe-expand)
                                ;; (define-key yas/keymap [tab] 'yas/next-field)
                                ;; make the lines in the buffer wrap around the edges of the screen.
                                ;; YES!!!!! These next two modes auto-indents org-buffers as you type!  NO NEED FOR
                                ;; to press C-c q  or fill-paragraph ever again!
                                (visual-line-mode)
                                (org-indent-mode)
                                (require 'writegood-mode)
                                ;; apparently this does the same thing as the above combined modes
                                ;; this seems to work better than visual line mode.  Why have I not heard of this before?
                                ;;(toggle-word-wrap)
                                (org-bullets-mode 1)
                                ;;make ">=" look like >=, etc.
                                (push '(">=" . ?≥) prettify-symbols-alist)
                                (push '("<=" . ?≤) prettify-symbols-alist)
                                (push '("\\geq" . ?≥) prettify-symbols-alist)
                                (push '("\\leq" . ?≤) prettify-symbols-alist)
                                (push '("\\neg" . ?¬) prettify-symbols-alist)
                                (push '("\\rightarrow" . ?→) prettify-symbols-alist)
                                (push '("\\leftarrow" . ?←) prettify-symbols-alist)
                                (push '("\\infty" . ?∞) prettify-symbols-alist)
                                (push '("-->" . ?→) prettify-symbols-alist)
                                (push '("<--" . ?←) prettify-symbols-alist)
                                (push '("\\exists" . ?∃) prettify-symbols-alist)
                                (push '("\\nexists" . ?∄) prettify-symbols-alist)
                                (push '("\\forall" . ?∀) prettify-symbols-alist)
                                (push '("\\or" . ?∨) prettify-symbols-alist)
                                (push '("\\and" . ?∧) prettify-symbols-alist)
                                (push '(":)" . ?☺) prettify-symbols-alist)
                                (push '("):" . ?☹) prettify-symbols-alist)
                                (push '(":D" . ?☺) prettify-symbols-alist)
                                (push '("\\checkmark" . ?✓) prettify-symbols-alist)
                                (push '("\\check" . ?✓) prettify-symbols-alist)
                                (push '("1/4" . ?¼) prettify-symbols-alist)
                                (push '("1/2" . ?½) prettify-symbols-alist)
                                (push '("3/4" . ?¾) prettify-symbols-alist)
                                (push '("1/7" . ?⅐) prettify-symbols-alist)
                                ;; ⅕ ⅖ ⅗ ⅘ ⅙ ⅚ ⅛ ⅜ ⅝ ⅞
                                (push '("ae" . ?æ) prettify-symbols-alist)
                                (push '("^_^" . ?☻) prettify-symbols-alist)))

(setq
 ;; hide the leading stars in my org files
 org-hide-leading-stars t
 ;;seeing the ... that org mode does to how you that the heading continues in the text beneith it is kind of boring
 ;; http://endlessparentheses.com/changing-the-org-mode-ellipsis.html?source=rss
 ;; Other interesting characters are ↴, ⬎, ⤷, and ⋱.
 org-ellipsis " ↴"
 ;; make RET follow a link
 org-return-follows-link t
 ;; only show times on items in the agenda, if we have an item at a specified time
 ;; if we set it to true, then we see all the times every 2 hours.  Takes up too much space.
 org-agenda-use-time-grid nil
 ;;org-ellipsis "⬎"
 ;; org-ellipsis "⤵"
 ;; don't let me accidentally delete text without realizing it in org.  ie: point is buried in a subtree, but you only
 ;; see the heading and you accidentally kill a line without knowing it.
 ;; this might not be supported for evil-mode
 org-catch-invisible-edits 'show-and-error
 ;; whenever I change state from TODO to DONE org will log that timestamp. Let's put that in a drawer
 org-log-into-drawer t
 ;; make org-mode record the date when you finish a task
 org-log-done 'time
 ;;org-log-done 'nil
 ;; when you press S-down, org changes the timestamp under point
 org-edit-timestamp-down-means-later t
 ;; make the agenda start on today not wednesday
 org-agenda-start-on-weekday nil
 ;; don't make the agenda only show saturday and Sunday if today is saturday. Make it show 7 days
 org-agenda-span 7
 ;; using the diary slows down the agenda view
 ;; but it also shows you upcoming calendar events
 org-agenda-include-diary t
 ;; this tells the agenda to take up the whole window and hide all other buffers
 org-agenda-window-setup 'current-window
 ;; this tells org-mode to only quit selecting tags for things when you tell it that you are done with it
 org-fast-tag-selection-single-key nil
 org-html-validation-link nil
 org-export-kill-product-buffer-when-displayed t
 ;; are there more backends that I can use?
 org-export-backends '(ascii beamer html texinfo latex)
 ;;most of these modules let you store links to various stuff in org
 org-bullets-bullet-list
 '("◉" "◎" "♠" "○" "►" "◇")
 org-modules '(org-bbdb org-gnus org-info org-invoice man org-toc org-habit org-mime org-crypt org-bullets org-id)
 ;; load in the org-modules
 ;;org-load-modules-maybe t
 ;; where to put the :action: or :work: tag after a heading.  80 colums over
 org-tags-column 80
 ;; don't ask me if I want to run an babel code block.  I know what I'm doing
 org-confirm-babel-evaluate nil
 ;; activate org speed commands
 org-use-speed-commands t)

;;a visual hint to let you know what line you are in in org-mode agenda
(add-hook 'org-agenda-finalize-hook (lambda () (hl-line-mode)))
