lisp/init-org.org
** my org capure templates
:PROPERTIES:
:ID:       e7e19c92-c2a6-437c-8aad-df01fe3c8437
:END:
  This is SOOOO USEFUL!!!! Org capture lets you quickly jot down a thought that you have and place it in a file under
  a heading that you specify.  I have captchas for shopping, for books to read, for things to do.

  #+BEGIN_SRC emacs-lisp
    (setq org-capture-templates
          '(

            ("B" "Things I want to buy" entry (file+headline
                                               "~/programming/org/projects/managing-my-monies.org" "things I want to buy")
             "* %?\nEntered on %U\n  %i\n  %a")

            ("c" "Computers Anything")
            ("ca" "Awesome WM" entry (file+headline "~/programming/org/gtd.org" "awesome WM someday")
             "* TODO %?\nEntered on %U\n  %i\n  %a")


             ;; Emacs things
            ("ce" "Emacs")

            ("ceb" "bugs" entry (file+headline "~/programming/org/projects/become-an-awesome-hacker.org" "Emacs bugs")
             "* TODO %?\n  %i\n  %a")

            ("ceb" "evil-mode" entry (file+headline "~/programming/org/projects/become-an-awesome-hacker.org" "evil-mode")
             "* TODO %?\n  %i\n  %a")

            ("cef" "flycheck" entry (file+headline "~/programming/org/projects/become-an-awesome-hacker.org" "flycheck-mode")
             "* TODO %?\n  %i\n  %a")

            ("ceM" "Emacs Meetup" entry (file+headline "~/programming/org/projects/emacs-meetup-vincent-laf-emacslaf.org" "things to talk about")
             "* %?\nEntered on %U\n  %i\n  %a")

            ("ceo" "Org-mode" entry (file+headline "~/programming/org/projects/become-an-awesome-hacker.org" "org-mode")
             "* TODO %?\n  %i\n  %a")
             ("ceR" "Emacs Reference")
            ("ceRR" "Emacs Reference" entry (file+headline "~/programming/org/projects/become-an-awesome-hacker.org" "emacs reference")
             "* %?\nEntered on %U\n  %i\n  %a")
             ("ceRe" "emacs evil reference" entry (file+headline "~/programming/org/projects/become-an-awesome-hacker.org" "evil reference")
             "* TODO %?\n  %i\n  %a")
             ("ceRg" "emacs gnus reference" entry (file+headline "~/programming/org/projects/become-an-awesome-hacker.org" "gnus reference")
             "* TODO %?\n  %i\n  %a")
            ("ceRo" "emacs org reference" entry (file+headline "~/programming/org/projects/become-an-awesome-hacker.org" "org reference")
             "* TODO %?\n  %i\n  %a")
            ("ceRm" "emacs magit reference" entry (file+headline "~/programming/org/projects/become-an-awesome-hacker.org" "tags reference")
             "* TODO %?\n  %i\n  %a")
            ("ceRt" "emacs tags reference" entry (file+headline "~/programming/org/projects/become-an-awesome-hacker.org" "tags reference")
             "* TODO %?\n  %i\n  %a")

             ("cet" "emacs Todo")
            ("cett" "emacs Todo" entry (file+headline "~/programming/org/projects/become-an-awesome-hacker.org" "emacs someday")
             "* TODO %?\n  %i\n  %a")
            ("cete" "emacs evil someday" entry (file+headline "~/programming/org/projects/become-an-awesome-hacker.org" "evil someday")
             "* TODO %?\n  %i\n  %a")
            ("cetf" "emacs flycheck someday" entry (file+headline "~/programming/org/projects/become-an-awesome-hacker.org" "flycheck someday")
             "* TODO %?\n  %i\n  %a")
            ("cetg" "emacs gnus someday" entry (file+headline "~/programming/org/projects/become-an-awesome-hacker.org" "gnus someday")
             "* TODO %?\n  %i\n  %a")
            ("ceth" "emacs helm someday" entry (file+headline "~/programming/org/projects/become-an-awesome-hacker.org" "helm someday")
             "* TODO %?\n  %i\n  %a")
            ("ceto" "emacs org someday" entry (file+headline "~/programming/org/projects/become-an-awesome-hacker.org" "org someday")
             "* TODO %?\n  %i\n  %a")
            ("cetT" "emacs tags someday" entry (file+headline "~/programming/org/projects/become-an-awesome-hacker.org" "tags someday")
             "* TODO %?\n  %i\n  %a")
            ("cetw" "web-mode someday" entry (file+headline "~/programming/org/projects/become-an-awesome-hacker.org" "web-mode someday")
             "* TODO %?\n  %i\n  %a")
             ;;End Emacs things


            ("cG" "Gimp Basics Reference" entry (file+headline "~/manuals/gimp.org" "Basic Concepts")
             "* %?\nEntered on %U\n  %i\n  %a")
            ("cH" "The GNU HURD")
            ("cHt" "Hurd" entry (file+headline "~/programming/org/projects/become-an-awesome-hacker.org"
                                               "Hurd")
             "* TODO %?\n  %i\n  %a")
            ("ct" "General Computer TODO"
             entry (file+headline "~/programming/org/projects/become-an-awesome-hacker.org" "General TODO")
             "* TODO %?\n  %i\n  %a")
            ("cw" "Waypoint")
            ("cwi" "ibca Web App")
            ("cwib" "bugs that need fixin'" entry (file+headline "~/programming/org/projects/working-for-waypoint.org"
                                                                 "bugs that need fixin'")
             "* TODO %?\n  %i\n  %a")
            ("cwic" "core features that must be done" entry (file+headline "~/programming/org/projects/working-for-waypoint.org"
                                                                           "core features that must be done")
             "* TODO %?\n  %i\n  %a")
            ("cwif" "features the app should have" entry (file+headline "~/programming/org/projects/working-for-waypoint.org"
                                                                        "features the app should have") "* TODO %?\n  %i\n  %a")
            ("cwir" "IBCA Reference" entry (file+headline "~/programming/org/projects/working-for-waypoint.org"
                                                          "IBCA Reference") "* %?\nEntered on %U\n  %i\n  %a")
            ("cwiw" "what I have done" entry (file+headline "~/programming/org/projects/working-for-waypoint.org"
                                                            "what I have done") "* DONE %?\n  %i\n  %a")
            ("ch" "high star todo"
             entry (file+headline "~/programming/org/projects/become-an-awesome-hacker.org" "make high star an android app")
             "* todo %?\n  %i\n  %a")
            ("cl" "linux TODO" entry (file+headline "~/programming/org/projects/become-an-awesome-hacker.org" "linux someday")
             "* TODO %?\n  %i\n  %a")
            ("cL" "Linux Reference" entry (file+headline "~/programming/org/projects/become-an-awesome-hacker.org" "linux reference")
             "* %?\nEntered on %U\n  %i\n  %a")
            ("co" "organ TODO" entry (file+headline "~/programming/org/projects/become-an-awesome-hacker.org" "make organ an android app")
             "* TODO %?\n  %i\n  %a")
            ("cf" "Free the world" entry (file+headline "~/programming/org/gtd.org" "free the world free content")
             "* %?\nEntered on %U\n  %i\n  %a")

            ("cW" "Web")

            ("cWA" "Accrisoft Reference" entry (file+headline "~/programming/org/web.org" "Accrisoft reference")
             "* %?\nEntered on %U\n  %i\n  %a")

            ("cWB" "Bootstrap Reference" entry (file+headline "~/programming/org/web.org" "Bootstrap reference")
             "* %?\nEntered on %U\n  %i\n  %a")

            ("cWS" "Shoppify Reference" entry (file+headline "~/programming/org/web.org" "Shoppify reference")
             "* %?\nEntered on %U\n  %i\n  %a")

            ("cWW" "Web reference" entry (file+headline "~/programming/org/web.org" "Web reference")
             "* %?\nEntered on %U\n  %i\n  %a")


            ("C" "Community")
            ("Cc" "community TODO" entry (file+headline "~/programming/org/gtd.org" "community someday")
             "* TODO %?\n  %i\n  %a")

            ("Cn" "nice things to say" entry (file+headline "~/programming/org/projects/get-close-to-God.org" "nice things to say")
             "* TODO %?\nEntered on %U\n  %i\n  %a")
            ("Cs" "Social Skills Notes" entry (file+headline "~/programming/org/being-social.org" "Social Skills Notes")
             "* %?\nEntered on %U\n  %i\n  %a")

            ("C" "Calendar TODO" entry (file+headline "~/programming/org/gtd.org" "calendar")
             "* TODO %?\n  %i\n  %a")

            ("e" "entertainment")
            ("eb" "Books to Read" entry (file+headline "~/programming/org/projects/whatever-I-want.org"
                                                       "Books to Read") "*  %i\n  %a")
            ("eM" "Good Movies Reference" entry (file+headline "~/programming/org/projects/whatever-I-want.org" "Good Movies") "*  %i\n  %a")
            ("em" "movies to watch" entry (file+headline "~/programming/org/projects/whatever-I-want.org" "movies to watch") "*  %i\n  %a")
            ("eU" "good music reference" entry (file+headline "~/programming/org/projects/whatever-I-want.org"
                                                              "good music reference") "*  %i\n  %a")
            ("eg" "games to play" entry (file+headline "~/programming/org/projects/whatever-I-want.org"
                                                       "games to play") "*  %i\n  %a")

            ("g" "getting close to God")
            ("gg" "get a close friend" entry (file+headline "/home/joshua/programming/org/projects/get-close-to-God.org"
                                                            "get a close friend") "* TODO %?\n  %i\n  %a")
            ("gb" "Boundaries")
            ("gbn" "Boundary Notes" entry (file+headline "~/programming/org/gtd.org" "Boundary Notes")
             "* %?\nEntered on %U\n  %i\n  %a")
            ("gbl" "Lowering My Expectations of Myself" entry (file+headline "~/programming/org/gtd.org"
                                                                             "Lowering My Expectations of Myself")
             "* %?\nEntered on %U\n  %i\n  %a")
            ("gbs" "Boundaries To Enforce" entry (file+headline "~/programming/org/projects/get-close-to-God.org" "Setting Boundaries")
             "* TODO %?\n  %i\n  %a")



            ("M" "Math")
            ("Mf" "fun math problems" entry (file+headline "/home/joshua/programming/org/projects/math.org" "fun math problems") "* TODO %?\n  %i\n  %a")
            ("p" "payless TODO" entry (file+headline "~/programming/org/gtd.org" "shopping todo")
             "* TODO %?\n  %i\n  %a")
            ("r" "Reference" entry (file+headline "~/programming/org/gtd.org" "general reference")
             "* %?\nEntered on %U\n  %i\n  %a")
            ("t" "TODO" entry (file+headline "~/programming/org/gtd.org" "general todo")
             "* TODO %?\nEntered on %U\n  %i\n  %a")
            ("w" "Weblink" entry (file (expand-file-name "~/programming/org/gtd.org" "org capture"))
             "* %c\n  :PROPERTIES:\n  :CREATED: %U\n  :END:\n  - Quote:\n    %i" :unnarrowed)

            ("q" "Quotations" entry (file+headline "~/programming/org/quotes.org" "Quotations")
             "* %?\nEntered on %U\n  %i\n  %a")
            ))
  #+END_SRC


  #+RESULTS:
  | B | Things I want to buy | entry | (file+headline ~/programming/org/projects/managing-my-monies.org things I want to buy) | * %? |

