lisp/init-org.org
** COMMENT Agenda Configuration
*** Agenda icons via Category
:PROPERTIES:
:ID:       1f343138-b49f-447e-8f34-2a1d05bc3af2
:END:
   You can easily create custom icons to show up in your agenda next to your specific tasks. My icons are all about
   30 by 30 px.
   #+BEGIN_SRC emacs-lisp
    (setq org-agenda-category-icon-alist '(
                                      ("hacker"      "/home/joshua/pictures/org-icons/gnu-linux-icon.png" nil nil nil nil)
                                      ("MAKING CASH"   "/home/joshua/pictures/org-icons/money.png" nil nil nil nil)
                                      ("SEEKING GOD" "/home/joshua/pictures/org-icons/god.png" nil nil nil nil)
                                      ("BILLS"    "/home/joshua/pictures/org-icons/bills.png" nil nil nil nil)
                                      ("emacs"       "/home/joshua/pictures/org-icons/emacs.png" nil nil nil nil)
                                      ("WORK"       "/home/joshua/pictures/org-icons/work.png" nil nil nil nil)
                                      ))
   #+END_SRC

   #+RESULTS:
   | hacker      | /home/joshua/pictures/org-icons/gnu-linux-icon.png | nil | nil | nil | nil |
   | MAKING CASH | /home/joshua/pictures/org-icons/money.png          | nil | nil | nil | nil |
   | SEEKING GOD | /home/joshua/pictures/org-icons/god.png            | nil | nil | nil | nil |
   | BILLS       | /home/joshua/pictures/org-icons/bills.png          | nil | nil | nil | nil |
   | emacs       | /home/joshua/pictures/org-icons/emacs.png          | nil | nil | nil | nil |
   | WORK        | /home/joshua/pictures/org-icons/work.png           | nil | nil | nil | nil |
*** I would like to generate my org-agenda-files
:PROPERTIES:
:ID:       655610ba-7bc8-4cb8-b5a4-7e8d754f84b2
:END:

But I haven't been able to figure out how to do it.

  Org-agenda-files are a list of files where you store your TODOs.  These are your things that need to be done, scheduled items,
  deadlines, recurring items, etc.  Then pressing "C-c a a" lets you build your agenda from all of your agenda files.  It is very
  useful. But it would be a pain to have to manually enter all of your agenda files.  So I've got some code here that I found online
  that lets me generate my agenda files.

  Org-refile-targets are a list of files and possibly headings in any org file that you can at any time jump to move pits of an
  org file to.  So let's say you're in weekly schedule.org, BUT you wish to quickly jump to shopping.org at the heading
  "Groceries",  you can very easily do that.

  EDIT:  I'm not really sure if this code is worth it.  The command org-agenda-files already stores your agenda files,  and I think that my custom.el file already keeps track of my agenda files.  Furthermore, (org-agenda-file-to-front) bound to "C-c [" is a nice way to keep track of agenda files.

  #+BEGIN_SRC emacs-lisp

    (defun my-org-list-files (dirs ext)
      "Function to create list of org files in multiple subdirectories.
    This can be called to generate a list of files for
    org-agenda-files or org-refile-targets.

    DIRS is a list of directories.

    EXT is a list of the extensions of files to be included."
      (let ((dirs (if (listp dirs)
                      dirs
                    (list dirs)))
            (ext (if (listp ext)
                     ext
                   (list ext)))
            files)
        (mapc
         (lambda (x)
           (mapc
            (lambda (y)
              (setq files
                    (append files
                            (file-expand-wildcards
                             (concat (file-name-as-directory x) "*" y)))))
            ext))
         dirs)
        (mapc
         (lambda (x)
           (when (or (string-match "/.#" x)
                     (string-match "#$" x))
             (setq files (delete x files))))
         files)
        files))


    (defvar my-org-agenda-directories '("~/programming/org/")
      "List of directories containing org files.")
    (defvar my-org-agenda-extensions '(".org")
      "List of extensions of agenda files")

    (setq my-org-agenda-directories '(
                                      "~/gtd/"
                                      "~/programming/org/"
                                      "~/programming/org/"
                                      "~/programming/org/projects"))
    (setq my-org-agenda-extensions '(".org"))

    (defun my-org-set-agenda-files ()
      (interactive)
      (setq org-agenda-files (my-org-list-files
                              my-org-agenda-directories
                              my-org-agenda-extensions)
            ;;org-refile-targets (my-org-list-files
            ;;                  my-org-agenda-directories
            ;;                my-org-agenda-extensions
            ;;  )
            ))

    (my-org-set-agenda-files)

  #+END_SRC

  Refile targets include this file and any file contributing to the agenda - up to 5 levels deep  But unfortunately, I cannot
  get org-refile to work.


  You absolutely want org-refile targets!!! Trust me on this!!!  You can very quickly jot down your todo list in org,
  in no particular order, then when your list is done, you can quickly refile your agenda files very quickly.  This works awesomeingly with helm-mode.


  This was some crusty code that I'm not sure if I need to keep to get refile targets to work.

  ;; (setq org-completion-use-ido nil)
  ;; (setq org-refile-allow-creating-parent-nodes t)

  #+BEGIN_SRC emacs-lisp
    (setq org-refile-targets '((nil :maxlevel . 2)
                               (org-agenda-files :tag . "capture")
                               (org-agenda-files :maxlevel . 2)))
    (setq org-outline-path-complete-in-steps nil)         ; Refile in a single go
    (setq org-refile-use-outline-path t)                  ; Show full paths for refiling
  #+END_SRC

*** My custom agenda commands
:PROPERTIES:
:ID:       928397ca-699b-41db-bcee-9e6f1a306d86
:END:
    Any commands that I make here are accessable with C-c a <key>

    #+BEGIN_SRC emacs-lisp
      (setq org-agenda-custom-commands
            '(
              ;; a global search for agenda entries planned this week/day
              ("x" agenda)

              ;; a global search for agenda entries planned this week/day, but
              ;;only those with hour specifications
              ("y" agenda*)

              ;; a global searcher with "WAITING" as the TODO keywoard
              ;; but I don't use waiting as a keyword
              ;; ("w" todo "WAITING")
              ;; ("w" todo "WAITING")

              ("D" todo "DELEGATED" )

              ;; the same search bit with searching for projects
              ("P" todo "PROJECT")


              ("S" todo "STARTED" )

              ("c" todo "CHARGED")

              ;; the same search but only in the current buffer and displaying the
              ;; results as a sparse tree
              ("W" todo-tree "WAITING")

              ;; a global search for headlines marked :boss: bot not :urgent:
              ("u" tags "+boss-urgent")

              ;; The same search but limiting the search to items that are TODO items
              ("v" tags-todo "+boss-urgent")

              ;; the same search as C-c a u but only in the current buffer displaying
              ;; the results in a sparse tree
              ("U" tags-tree "+boss-urgent")

              ;; Create a sparse tree in the current buffer with all entries containing
              ;;the word FIXME
              ("f" occur-tree "\\<FIXME\\>")

              ;;
              ;; ("h" . "HOME+Name tags searches") ; description for "h" prefix
              ;; ("hl" tags "+home+Lisa")
              ;; ("hp" tags "+home+Peter")
              ;; ("hk" tags "+home+Kim")


            ;; ("H" "Office and Home Lists"
            ;; ((agenda)
            ;; (tags-todo "OFFICE")
            ;; (tags-todo "HOME")
            ;; (tags-todo "COMPUTER")
            ;; (tags-todo "DVD")
            ;; (tags-todo "READING")))
              )
            )
    #+END_SRC
***** COMMENT grading myself file.
    I have a file that keeps tracks of the things that I want to do often.  This opens that.
    #+BEGIN_SRC emacs-lisp
      (defun my/org-grading-myself-agenda ()
      "This function loads up my grading myself toolset."
      (interactive)
      (let (org-agenda-files)
        (setq org-agenda-files '("/home/joshua/programming/org/projects/grading-myself.org"))
        (org-agenda-list)))

      (org-defkey org-agenda-mode-map "g" 'org-agenda-filter-by-category)
      ;;(org-defkey global-map (kbd "C-c a g") 'org-agenda-filter-by-category)
    #+END_SRC

    #+BEGIN_SRC emacs-lisp
      (defun my/org-grading-myself-agenda-and-regular-agenda ()
        "This function loads up my grading myself toolset."
        (interactive)
        (add-to-list 'org-agenda-files '"/home/joshua/programming/org/projects/grading-myself.org")
        (org-agenda-list)
        ;;how do you remove an element from a list?  I have no idea.
        )
    #+END_SRC
