lisp/init-org.el

(setq org-agenda-category-icon-alist '(
                                  ("hacker"      "/home/joshua/pictures/org-icons/gnu-linux-icon.png" nil nil nil nil)
                                  ("MAKING CASH"   "/home/joshua/pictures/org-icons/money.png" nil nil nil nil)
                                  ("SEEKING GOD" "/home/joshua/pictures/org-icons/god.png" nil nil nil nil)
                                  ("BILLS"    "/home/joshua/pictures/org-icons/bills.png" nil nil nil nil)
                                  ("emacs"       "/home/joshua/pictures/org-icons/emacs.png" nil nil nil nil)
                                  ("WORK"       "/home/joshua/pictures/org-icons/work.png" nil nil nil nil)
                                  ))

(defun my-org-list-files (dirs ext)
  "Function to create list of org files in multiple subdirectories.
This can be called to generate a list of files for
org-agenda-files or org-refile-targets.

DIRS is a list of directories.

EXT is a list of the extensions of files to be included."
  (let ((dirs (if (listp dirs)
                  dirs
                (list dirs)))
        (ext (if (listp ext)
                 ext
               (list ext)))
        files)
    (mapc
     (lambda (x)
       (mapc
        (lambda (y)
          (setq files
                (append files
                        (file-expand-wildcards
                         (concat (file-name-as-directory x) "*" y)))))
        ext))
     dirs)
    (mapc
     (lambda (x)
       (when (or (string-match "/.#" x)
                 (string-match "#$" x))
         (setq files (delete x files))))
     files)
    files))


(defvar my-org-agenda-directories '("~/programming/org/")
  "List of directories containing org files.")
(defvar my-org-agenda-extensions '(".org")
  "List of extensions of agenda files")

(setq my-org-agenda-directories '("~/programming/org/" "~/programming/org/"
                                  "~/programming/org/projects"))
(setq my-org-agenda-extensions '(".org"))

(defun my-org-set-agenda-files ()
  (interactive)
  (setq org-agenda-files (my-org-list-files
                          my-org-agenda-directories
                          my-org-agenda-extensions)
        ;;org-refile-targets (my-org-list-files
          ;;                  my-org-agenda-directories
            ;;                my-org-agenda-extensions
                          ;;  )
        ))

(my-org-set-agenda-files)

(setq org-refile-targets '((nil :maxlevel . 2)
                           (org-agenda-files :tag . "capture")
                           (org-agenda-files :maxlevel . 2)))
(setq org-outline-path-complete-in-steps nil)         ; Refile in a single go
(setq org-refile-use-outline-path t)                  ; Show full paths for refiling

(setq org-agenda-custom-commands
      '(
        ;; a global search for agenda entries planned this week/day
        ("x" agenda)

        ;; a global search for agenda entries planned this week/day, but
        ;;only those with hour specifications
        ("y" agenda*)

        ;; a global searcher with "WAITING" as the TODO keywoard
        ;; but I don't use waiting as a keyword
        ;; ("w" todo "WAITING")
        ;; ("w" todo "WAITING")

        ("D" todo "DELEGATED" )

        ;; the same search bit with searching for projects
        ("P" todo "PROJECT")


        ("S" todo "STARTED" )

        ("c" todo "CHARGED")

        ;; the same search but only in the current buffer and displaying the
        ;; results as a sparse tree
        ("W" todo-tree "WAITING")

        ;; a global search for headlines marked :boss: bot not :urgent:
        ("u" tags "+boss-urgent")

        ;; The same search but limiting the search to items that are TODO items
        ("v" tags-todo "+boss-urgent")

        ;; the same search as C-c a u but only in the current buffer displaying
        ;; the results in a sparse tree
        ("U" tags-tree "+boss-urgent")

        ;; Create a sparse tree in the current buffer with all entries containing
        ;;the word FIXME
        ("f" occur-tree "\\<FIXME\\>")

        ;;
        ;; ("h" . "HOME+Name tags searches") ; description for "h" prefix
        ;; ("hl" tags "+home+Lisa")
        ;; ("hp" tags "+home+Peter")
        ;; ("hk" tags "+home+Kim")


      ;; ("H" "Office and Home Lists"
      ;; ((agenda)
      ;; (tags-todo "OFFICE")
      ;; (tags-todo "HOME")
      ;; (tags-todo "COMPUTER")
      ;; (tags-todo "DVD")
      ;; (tags-todo "READING")))
        )
      )

(defun my/org-grading-myself-agenda ()
"This function loads up my grading myself toolset."
(interactive)
(let (org-agenda-files)
  (setq org-agenda-files '("/home/joshua/programming/org/projects/grading-myself.org"))
  (org-agenda-list)))

(org-defkey org-agenda-mode-map "g" 'org-agenda-filter-by-category)
;;(org-defkey global-map (kbd "C-c a g") 'org-agenda-filter-by-category)

(defun my/org-grading-myself-agenda-and-regular-agenda ()
  "This function loads up my grading myself toolset."
  (interactive)
  (add-to-list 'org-agenda-files '"/home/joshua/programming/org/projects/grading-myself.org")
  (org-agenda-list)
  ;;how do you remove an element from a list?  I have no idea.
  )
