lisp/init-org.org
** I can make add words to the TODO and DONE keywords
:PROPERTIES:
:ID:       bc85cb78-e963-49ba-98f6-0f3b232029ed
:END:
  #+BEGIN_SRC emacs-lisp
  ; Targets start with the file name - allows creating level 1 tasks
    (setq org-refile-use-outline-path (quote file))
  #+END_SRC

  : file

  I want to make specific TODO states.  Anything after the "|" is marked completed and appears green.  Anything before it, shows
  that the item is still actionable and it is red.

  I should also point out, that most people will probably want TODO to be the first keyword.  Suppose that you have a recurring
  task like the following:

  #+BEGIN_SRC org
    ,* TODO Brush my teeth
      SCHEDULED: <2015-11-15 Sun +1d>
      :LOGBOOK:
      - State "TODO"       from              [2015-11-15 Sun 09:24]
      :END:
  #+END_SRC

  Whenever you complete this task, and do a C-c C-t (org-todo), org will put a short message inside a drawer under the item.
  Then, since this item is not properly DONE (since it still repeats), org-mode will try to find the proper TODO state to put in.
  By default, org-mode uses the first keyword specified by org-todo-keywords.  So most users will probably want to make TODO
  the first keyword.

  Also the TODO(t!), means that "t" will be used as the quick key for this TODO entry in the todo pop up dialog.  The "!" means to
  only record the time of the state change. You can also use a "@" instead of "!" to specify that you would like to enter a note
  when you change the item's state.  So "DONE(d@)" means that you want to use d as the shortcut key, and you'd org-mode to prompt
  you for a not when you do so.

  You can also have syntax like "PROJECT(p@/!)", which means to record a note when you change an items TODO keyword to project,
  and you'd like to only record a timestamp if that item's keyword ever changes to any other todo keyword.

  Apparently I can define a NEXTACTION keyword too. http://thread.gmane.org/gmane.emacs.orgmode/523


  Set my todo keywords
  #+BEGIN_SRC emacs-lisp

    (setq org-todo-keywords
          '((sequence "TODO(t!)" "PROJECT(r)" "STARTED(s!)"
                      "WAITING(w!)" "CHARGED(c!)" "|" "PAID(p!)" "DONE(d!)")))


    (setq org-todo-keyword-faces
          '(("PROJECT" . "#4da6ff")
            ("STARTED" . "#ffff99")
            ("WAITING" . "#ffcc00")
            ("CHARGED" .  "#e085e0")))


  #+END_SRC

  #+RESULTS:
  : ((PROJECT . #4da6ff) (STARTED . #ffff99) (WAITING . #ffcc00) (CHARGED . #e085e0))

  #+BEGIN_SRC emacs-lisp

  #+END_SRC

** Org Clock Settings
:PROPERTIES:
:ID:       97426883-1e15-4141-8161-a128d91920ce
:END:
This puts up in my top of my buffer the current running org clock.

  #+BEGIN_SRC emacs-lisp

;; Save the running clock and all clock history when exiting Emacs, load it on startup
(setq org-clock-persistence-insinuate t)
(setq org-clock-persist t)
(setq org-clock-in-resume t)

;; Change task state to STARTED when clocking in
(setq org-clock-in-switch-to-state "STARTED")
;; Save clock data and notes in the LOGBOOK drawer
(setq org-clock-into-drawer t)
;; Removes clocked tasks with 0:00 duration
(setq org-clock-out-remove-zero-time-clocks t)

;; Show clock sums as hours and minutes, not "n days" etc.
(setq org-time-clocksum-format
      '(:hours "%d" :require-hours t :minutes ":%02d" :require-minutes t))

;; Show the clocked-in task - if any - in the header line
(defun sanityinc/show-org-clock-in-header-line ()
  (setq-default header-line-format '((" " org-mode-line-string " "))))

(defun sanityinc/hide-org-clock-from-header-line ()
  (setq-default header-line-format nil))

(add-hook 'org-clock-in-hook #'sanityinc/show-org-clock-in-header-line)
(add-hook 'org-clock-out-hook #'sanityinc/hide-org-clock-from-header-line)
(add-hook 'org-clock-cancel-hook #'sanityinc/hide-org-clock-from-header-line)

(after-load 'org-clock
  (define-key org-clock-mode-line-map [header-line mouse-2] #'org-clock-goto)
  (define-key org-clock-mode-line-map [header-line mouse-1] #'org-clock-menu))

;;you can start clocking in on an event in the agenda buffer by pressing P
;;(use-package org-pomodoro
;;  :ensure t)
;;(after-load 'org-agenda
;;  (define-key org-agenda-mode-map (kbd "P") 'org-pomodoro))
  #+END_SRC

  #+RESULTS:
  : org-pomodoro

** customizing stuck projects
:PROPERTIES:
:ID:       9d5b3ec8-b9f7-444f-b22d-d02185f2c9b4
:END:
There is apparently a way to specify in your org agenda files where you have a stuck project, but I haven't figured out how to do it.

  C-c a # will list all of your stuck projects.  According to David Allen's Getting Things Done productivity system,
  a stuck project [fn:1] is one where the next action is not defined.  That is, your project does not have any next actions.  No one
  knows what the next step to do is for the project.

  Anyway, org-stuck-projects helps you to identify where your projects are.   It is a list with 4 entries:
  - A tags/todo/propery that identifies this heading as a project
  - A list of todo keywords that show that this project is NOT stuck.  If any of these todo keywords show up under the projects'
    tree, then that project is not stuck
  - A list of tags identifying non-stuck projects
  - A regexp matching non-stuck projects

  #+BEGIN_SRC emacs-lisp
  (setq org-stuck-projects '("PROJECT" ("TODO NEXT") ("action") "\\<IGNORE\\>" ))
  #+END_SRC

* trying to get mmm-mode to work
:PROPERTIES:
:ID:       e6804191-77c5-4daa-963c-092b4cb482b6
:END:
#+BEGIN_SRC emacs-lisp
  (use-package mmm-mode :ensure t)

  (after-load 'org
    (require 'mmm-mode)
    (setq mmm-global-mode 'maybe)
    (mmm-add-mode-ext-class 'org-mode "\\.org\\'" 'org-elisp)

    ;; mmm-add-group is more useful for org-mode...probably
    (mmm-add-classes
     '(
       (org-elisp
        :submode 'emacs-lisp-mode
        :face mmm-declaration-submode-face
        :front "#+BEGIN_SRC emacs-lisp"
        :back  "#+END_SRC"
        )
       )
     ))
#+END_SRC
* COMMENT misc
:PROPERTIES:
:ID:       1a006baf-51cd-454a-950e-3af9ff1915c5
:END:
** a hydra that I found online that lets you easily remember some of the org commands
:PROPERTIES:
:ID:       721dc190-9af1-441d-b3fa-1cfc0a92bafb
:END:
  this is not working?
  we want to remember the org keyboard navigation commands eh?
  https://github.com/abo-abo/hydra/wiki/Emacs
  #+BEGIN_SRC emacs-lisp

(defhydra hydra-outline (:color pink :hint nil)
  "
^Hide^             ^Show^           ^Move
^^^^^^------------------------------------------------------
_hs_: sublevels     _sa_: all         _u_: up
_hb_: body          _se_: entry       _n_: next visible
_ho_: other         _sc_: children    _p_: previous visible
_he_: entry         _sb_: branches    _f_: forward same level
_hl_: leaves        _st_: subtree     _b_: backward same level
_ht_: subtree

"
  ;; Hide
  ("hs" hide-sublevels)    ; Hide everything but the top-level headings
  ("hb" hide-body)         ; Hide everything but headings (all body lines)
  ("ho" hide-other)        ; Hide other branches
  ("he" hide-entry)        ; Hide this entry's body
  ("hl" hide-leaves)       ; Hide body lines in this entry and sub-entries
  ("ht" hide-subtree)      ; Hide everything in this entry and sub-entries
  ;; Show
  ("sa" show-all)          ; Show (expand) everything
  ("se" show-entry)        ; Show this heading's body
  ("sc" show-children)     ; Show this heading's immediate child sub-headings
  ("sb" show-branches)     ; Show all sub-headings under this heading
  ("st" show-subtree)      ; Show (expand) everything in this heading & below
  ;; Move
  ("u" outline-up-heading)                ; Up
  ("n" outline-next-visible-heading)      ; Next
  ("p" outline-previous-visible-heading)  ; Previous
  ("f" outline-forward-same-level)        ; Forward - same level
  ("b" outline-backward-same-level)       ; Backward - same level

  ("z" nil "leave"))

(define-key org-mode-map (kbd "C-c #") 'hydra-outline/body) ; by example
(global-set-key (kbd "C-c #") 'hydra-outline/body)
  #+END_SRC

