lisp/init-org.el

; Targets start with the file name - allows creating level 1 tasks
  (setq org-refile-use-outline-path (quote file))

(setq org-todo-keywords
      '((sequence "TODO(t!)" "PROJECT(r)" "STARTED(s!)"
                  "WAITING(w!)" "CHARGED(c!)" "|" "PAID(p!)" "DONE(d!)")))


(setq org-todo-keyword-faces
      '(("PROJECT" . "#4da6ff")
        ("STARTED" . "#ffff99")
        ("WAITING" . "#ffcc00")
        ("CHARGED" .  "#e085e0")))



;; Save the running clock and all clock history when exiting Emacs, load it on startup
(setq org-clock-persistence-insinuate t)
(setq org-clock-persist t)
(setq org-clock-in-resume t)

;; Change task state to STARTED when clocking in
(setq org-clock-in-switch-to-state "STARTED")
;; Save clock data and notes in the LOGBOOK drawer
(setq org-clock-into-drawer t)
;; Removes clocked tasks with 0:00 duration
(setq org-clock-out-remove-zero-time-clocks t)

;; Show clock sums as hours and minutes, not "n days" etc.
(setq org-time-clocksum-format
      '(:hours "%d" :require-hours t :minutes ":%02d" :require-minutes t))

;; Show the clocked-in task - if any - in the header line
(defun sanityinc/show-org-clock-in-header-line ()
  (setq-default header-line-format '((" " org-mode-line-string " "))))

(defun sanityinc/hide-org-clock-from-header-line ()
  (setq-default header-line-format nil))

(add-hook 'org-clock-in-hook #'sanityinc/show-org-clock-in-header-line)
(add-hook 'org-clock-out-hook #'sanityinc/hide-org-clock-from-header-line)
(add-hook 'org-clock-cancel-hook #'sanityinc/hide-org-clock-from-header-line)

(after-load 'org-clock
  (define-key org-clock-mode-line-map [header-line mouse-2] #'org-clock-goto)
  (define-key org-clock-mode-line-map [header-line mouse-1] #'org-clock-menu))

;;you can start clocking in on an event in the agenda buffer by pressing P
;;(use-package org-pomodoro
;;  :ensure t)
;;(after-load 'org-agenda
;;  (define-key org-agenda-mode-map (kbd "P") 'org-pomodoro))

(setq org-stuck-projects '("PROJECT" ("TODO NEXT") ("action") "\\<IGNORE\\>" ))

(defhydra hydra-outline (:color pink :hint nil)
  "
^Hide^             ^Show^           ^Move
^^^^^^------------------------------------------------------
_hs_: sublevels     _sa_: all         _u_: up
_hb_: body          _se_: entry       _n_: next visible
_ho_: other         _sc_: children    _p_: previous visible
_he_: entry         _sb_: branches    _f_: forward same level
_hl_: leaves        _st_: subtree     _b_: backward same level
_ht_: subtree

"
  ;; Hide
  ("hs" hide-sublevels)    ; Hide everything but the top-level headings
  ("hb" hide-body)         ; Hide everything but headings (all body lines)
  ("ho" hide-other)        ; Hide other branches
  ("he" hide-entry)        ; Hide this entry's body
  ("hl" hide-leaves)       ; Hide body lines in this entry and sub-entries
  ("ht" hide-subtree)      ; Hide everything in this entry and sub-entries
  ;; Show
  ("sa" show-all)          ; Show (expand) everything
  ("se" show-entry)        ; Show this heading's body
  ("sc" show-children)     ; Show this heading's immediate child sub-headings
  ("sb" show-branches)     ; Show all sub-headings under this heading
  ("st" show-subtree)      ; Show (expand) everything in this heading & below
  ;; Move
  ("u" outline-up-heading)                ; Up
  ("n" outline-next-visible-heading)      ; Next
  ("p" outline-previous-visible-heading)  ; Previous
  ("f" outline-forward-same-level)        ; Forward - same level
  ("b" outline-backward-same-level)       ; Backward - same level

  ("z" nil "leave"))

(define-key org-mode-map (kbd "C-c #") 'hydra-outline/body) ; by example
(global-set-key (kbd "C-c #") 'hydra-outline/body)

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
