lisp/init-org.org
** A definition I found online org-begin-template
:PROPERTIES:
:ID:       f86e0ea8-f4f3-45d5-af1a-2b7c30d0a91f
:END:
  I should really check this out at some point http://pragmaticemacs.com/emacs/wrap-text-in-an-org-mode-block/ In my most recent
  post on org-mode, I talked about using blocks to mark text as being latex, or source code and so on. I mentioned using the
  shortcuts like <e then TAB on a new line to create an empty block. Sometimes it is handy to wrap existing text in a block, and
  the following function does that for the text you have selected.

  This has been in my config file for ages and I can’t remember where it came from – I know I didn’t write it! A bit of googleing
  suggests this could be the origin, but if anyone knows different, let me know.

  I bind the function to C-< because it reminds me of the < shortcuts to create the blocks, and I don’t use the
  org-cycle-agenda-files that is usually bound to that key combo.

  #+BEGIN_SRC emacs-lisp
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; function to wrap blocks of text in org templates                       ;;
  ;; e.g. latex or src etc                                                  ;;
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  (defun org-begin-template ()
  "Make a template at point."
  (interactive)
  (if (org-at-table-p)
      (call-interactively 'org-table-rotate-recalc-marks)
    (let* ((choices '(("s" . "SRC")
                      ("e" . "EXAMPLE")
                      ("q" . "QUOTE")
                      ("v" . "VERSE")
                      ("c" . "CENTER")
                      ("l" . "LaTeX")
                      ("h" . "HTML")
                      ("a" . "ASCII")))
           (key
            (key-description
             (vector
              (read-key
               (concat (propertize "Template type: " 'face 'minibuffer-prompt)
                       (mapconcat (lambda (choice)
                                    (concat (propertize (car choice) 'face 'font-lock-type-face)
                                            ": "
                                            (cdr choice)))
                                  choices
                                  ", ")))))))
      (let ((result (assoc key choices)))
        (when result
          (let ((choice (cdr result)))
            (cond
             ((region-active-p)
              (let ((start (region-beginning))
                    (end (region-end)))
                (goto-char end)
                (insert "#+END_" choice "\n")
                (goto-char start)
                (insert "#+BEGIN_" choice "\n")))
             (t
              (insert "#+BEGIN_" choice "\n")
              (save-excursion (insert "#+END_" choice))))))))))

;;bind to key
;;(define-key org-mode-map (kbd "C-<") 'org-begin-template)

#+END_SRC

** to load this file do =M-x org-babel-load-file= and it'll pop up helm and you'll have to say that you want
  to load this file.  All the scripts in this file will be exported and saved into init-org.el.  Then
  that file will be loaded.
* provide this file
:PROPERTIES:
:ID:       6d4c7e86-6fca-4b7c-b329-a1827a49e801
:END:
  #+BEGIN_SRC emacs-lisp
    (provide 'init-org)
  #+END_SRC
* Footnotes

[fn:2] I do use org-crypt in my erc-file to save some sensitive information.

[fn:1]  A project is an action that has multiple sequential steps.

|--------|
| img    |
| button |
|--------|
| img    |
| button |
|--------|
| img    |
| button |
|--------|
